---
kind: type
id: T:Autodesk.Revit.DB.PreferredJunctionType
source: html/c697d138-521c-175d-a708-42199c321afd.htm
---
# Autodesk.Revit.DB.PreferredJunctionType

Enumerated type representing the possible options for the preferred junction for a routine preference rule.

## Syntax (C#)
```csharp
public enum PreferredJunctionType
```